archtektura systemów komputerowych/wyklad01.tex
% Created 2022-10-04 Tue 23:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Rafał Grot}
\date{\today}
\title{archtektura systemów komputerowych wykład 01 04.10.2022}
\hypersetup{
 pdfauthor={Rafał Grot},
 pdftitle={archtektura systemów komputerowych wykład 01 04.10.2022},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{algorytmy}
\label{sec:org6b16de6}
\subsection{kodowania !}
\label{sec:orgdc62c89}
\begin{itemize}
\item NKB
\item U1 i U2
\item ZM
\item Satło i zmiennopozycyjny
\item ASCII
\item UNICODE
\end{itemize}
Jest ich wiele
\subsubsection{Kodowanie Gray'a}
\label{sec:org8905cb4}
\subsubsection{Ręcznie kodowanie RSA}
\label{sec:org06ef12b}
dla małych liczb
\section{komponenty}
\label{sec:orgaef5814}
\subsection{moduł logiczny}
\label{sec:orgf2873ed}
układ logiczny, którey orperuje zgodnie z ale=gebrą Boola'a.Najprostrzymi modułami są bramki logiczne realizujące proste operacje: iloczynu, sumy ,różnicy symetrycznej i negacji.
\subsection{porjektownie}
\label{sec:org88cbb00}
\begin{itemize}
\item metody klasyczne
\begin{itemize}
\item tablice Karnaugh
\end{itemize}
\item Języki HDL
(jeszcze żyją)
\end{itemize}
\subsection{funktory logiczne}
\label{sec:org311fb2f}
Są realizacją sprzętową matematycznego modelu funkcji logicznej.
dzielimy od złożności dzilimy na:
\begin{description}
\item[{Układy małe skali integracji (SSI)}] relizują podstawowe operacjie logiczne: AND, OR, NOT, XOR
\item[{średniej skali integracji (MSI)}] 
\end{description}
\section{przesyłanie informacji}
\label{sec:org0bd19a6}
\subsection{komunikacja}
\label{sec:org55e9697}
\subsubsection{W komputerach klasy PC}
\label{sec:org8030746}
Odbywa się na dwóch platformach
\begin{enumerate}
\item sprzętowej
\label{sec:orgef5bbef}
\begin{description}
\item[{wymiana danych między modułami komputera}] np CPU i pamięci
\item transmisje danych z/do pamięci masowej
\item przesyłanie z/do urządzeń peryferyjnyc
\end{description}
\item softwareowej
\label{sec:org3ac9780}
\begin{itemize}
\item transmitowanie pamięci między aplikacjami
\end{itemize}
\begin{enumerate}
\item przesyłanie danych między systemami komputerami (sieci komputerowe)
\label{sec:orgfa625f3}
\end{enumerate}
\item architektury połączeń
\label{sec:orgc7ac00f}
\begin{enumerate}
\item magistrali
\label{sec:orgfbafd44}
\item gwiazdy
\label{sec:org71f97ac}
\item pierścienia
\label{sec:orgb547a38}
\item siatki
\label{sec:org7fb5b65}
\end{enumerate}
\end{enumerate}
\section{Komputer klasy PC}
\label{sec:orge1d6a24}
\subsection{Posiada cechy:}
\label{sec:org1cc4df4}
\begin{description}
\item[{porgramowalność}] umożliwa uruchomienie dowolnego oprogramowania lub jego stworzenia
\item[{uniwersalne zastosowania}] \begin{description}
\item[{typowo użytkowe}] jako maszyna do pisania i gormadzenia danych, jako narzędzie obliczeniowe, wpracy biurowej
\item o charkaterze rozrywkowym
\item[{badawczo-naukowe}] w naukach ścisłych, w medycynie, w farmacji
\item[{wspomagające projektowanie}] np narzędzia CAD, CAE, CAI, CAM, CASE itp.
\end{description}
\item modularność konstrukcji
\end{description}
\subsection{komponenty}
\label{sec:org72b0fcc}
\begin{itemize}
\item monitor
\item klawaitura
\item urządzenie wskazujące (mysz)
\end{itemize}
\subsubsection{jednostka centralna}
\label{sec:orga5b2842}
\begin{enumerate}
\item CPU
\label{sec:org3bec1cc}
\item płyta główną
\label{sec:org5e923db}
\item karty roszerzające
\label{sec:org350283c}
NP:
\begin{itemize}
\item karty graficzne
\item karty muzyczne
\item karty sieciowe
\end{itemize}
\item pamięć operacyjna
\label{sec:orgfb1a471}
wykonana z modółów pamięci RAM
\end{enumerate}
\end{document}
